## Reading and Writing Data in Text Format

In [1]:
import pandas as pd 
import numpy as np

In [2]:
df = pd.read_csv('examples/ex1.txt')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [3]:
df = pd.read_csv('examples/ex1.txt', header=None)
df

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [4]:
df = pd.read_csv('examples/ex2.txt', header=None)
df

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [5]:
df = pd.read_csv('examples/ex2.txt', names=['a', 'b', 'c', 'd', 'message'])
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [6]:
df  = pd.read_csv('examples/ex2.txt', names=['a', 'b', 'c', 'd', 'message'], index_col='message')
df

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [7]:
parsed = pd.read_csv('examples/csv_mindex.csv', index_col=['key1', 'key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [8]:
result = pd.read_csv('examples/ex3.csv', delimiter='\s+')
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [9]:
pd.read_csv('examples/ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [10]:
result = pd.read_csv('examples/ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [11]:
pd.isna(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [12]:
result = pd.read_csv('examples/ex5.csv', na_values=['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [13]:
result2 = pd.read_csv('examples/ex5.csv', keep_default_na=False)
result2

  something  a   b   c   d message
0       one  1   2   3   4      NA
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [14]:
result3 = pd.read_csv('examples/ex5.csv',keep_default_na=False,  na_values=['', 'NA'])
result3

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [15]:
result3.isna()

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [16]:
sentinels = {'message': ['foo', 'NA'], 'something': ['one', 'two']}

pd.read_csv('examples/ex5.csv', keep_default_na=False, na_values=sentinels)

  something  a   b   c   d message
0       NaN  1   2   3   4     NaN
1       NaN  5   6       8   world
2     three  9  10  11  12     NaN

## Reading Text files in Pieces

In [17]:
pd.options.display.max_rows = 10
%precision 3

'%.3f'

In [18]:
result = pd.read_csv('examples/ex6.csv')
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [19]:
pd.read_csv('examples/ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

To read a file in pieces, specify a chunksize as a number of rows:

In [20]:
chunker = pd.read_csv('examples/ex6.csv', chunksize=1000)

In [21]:
type(chunker)

pandas.io.parsers.TextFileReader

In [22]:
tot = pd.Series([], dtype='int64')

In [23]:
tot.add(2)

Series([], dtype: int64)

In [24]:
tot

Series([], dtype: int64)

In [25]:
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)

In [26]:
tot.sort_values(ascending=False)[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

## Writing Data to text format

In [27]:
data = pd.read_csv('examples/ex5.csv')

In [28]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [29]:
data.to_csv('examples/out.csv')

In [30]:
pd.read_csv('examples/out.csv')

   Unnamed: 0 something  a   b     c   d message
0           0       one  1   2   3.0   4     NaN
1           1       two  5   6   NaN   8   world
2           2     three  9  10  11.0  12     foo

In [31]:
import sys

In [32]:
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [33]:
data.to_csv(sys.stdout, sep='|', na_rep='Null')

|something|a|b|c|d|message
0|one|1|2|3.0|4|Null
1|two|5|6|Null|8|world
2|three|9|10|11.0|12|foo

In [34]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [35]:
data.to_csv(sys.stdout, index=False, columns=list('abc'))

a,b,c
1,2,3.0
5,6,
9,10,11.0

## Working with Other Delimited Formats

In [130]:
import csv

In [131]:
f = open('examples/ex7.csv')
reader = csv.reader(f)

In [132]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [133]:
f.close()

From there, it’s up to you to do the wrangling necessary to put the data in the form that you need. Let's take this step by step. First, we read the file into a list of lines:

In [134]:
with open('examples/ex7.csv') as f:
    lines = list(csv.reader(f))

In [135]:
lines

[['a', 'b', 'c'], ['1', '2', '3'], ['1', '2', '3']]

In [136]:
header, values = lines[0], lines[1:]

In [137]:
header

['a', 'b', 'c']

In [44]:
values

[['1', '2', '3'], ['1', '2', '3']]

In [138]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [139]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

## Json Data

In [140]:
obj = """
{"name": "Wes",
 "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]},
              {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]
}
"""

In [141]:
obj

'\n{"name": "Wes",\n "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"],\n "pet": null,\n "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]},\n              {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]\n}\n'

In [142]:
type(obj)

str

In [143]:
import json

In [144]:
result = json.loads(obj)

In [145]:
result

{'name': 'Wes',
 'cities_lived': ['Akron', 'Nashville', 'New York', 'San Francisco'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 34, 'hobbies': ['guitars', 'soccer']},
  {'name': 'Katie', 'age': 42, 'hobbies': ['diving', 'art']}]}

In [74]:
type(result)

dict

In [146]:
asjson = json.dumps(result)

In [147]:
asjson

'{"name": "Wes", "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"], "pet": null, "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]}, {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]}'

In [148]:
type(asjson)

str

In [149]:
result

{'name': 'Wes',
 'cities_lived': ['Akron', 'Nashville', 'New York', 'San Francisco'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 34, 'hobbies': ['guitars', 'soccer']},
  {'name': 'Katie', 'age': 42, 'hobbies': ['diving', 'art']}]}

In [150]:
result['siblings'][0]['hobbies']

['guitars', 'soccer']

In [151]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])

In [152]:
siblings

    name  age
0  Scott   34
1  Katie   42

In [153]:
result

{'name': 'Wes',
 'cities_lived': ['Akron', 'Nashville', 'New York', 'San Francisco'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 34, 'hobbies': ['guitars', 'soccer']},
  {'name': 'Katie', 'age': 42, 'hobbies': ['diving', 'art']}]}

In [154]:
data = pd.read_json('examples/example.json')

In [155]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [156]:
data.to_json(sys.stdout)

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [157]:
data.to_json(sys.stdout, orient="records")

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

## XML and HTML: Web Scraping

In [158]:
tables = pd.read_html('examples/fdic_failed_bank_list.html')

In [159]:
tables

[                         Bank NameBank       CityCity StateSt  CertCert  \
 0             Heartland Tri-State Bank        Elkhart      KS     25851
 1                  First Republic Bank  San Francisco      CA     59017
 2                       Signature Bank       New York      NY     57053
 3                  Silicon Valley Bank    Santa Clara      CA     24735
 4                    Almena State Bank         Almena      KS     15426
 ..                                 ...            ...     ...       ...
 562                 Superior Bank, FSB       Hinsdale      IL     32646
 563                Malta National Bank          Malta      OH      6629
 564    First Alliance Bank & Trust Co.     Manchester      NH     34264
 565  National State Bank of Metropolis     Metropolis      IL      3815
 566                   Bank of Honolulu       Honolulu      HI     21029

                  Acquiring InstitutionAI Closing DateClosing  FundFund
 0                 Dream First Bank, N.A.       July 28, 2023     10544
 1              JPMorgan Chase Bank, N.A.         May 1, 2023     10543
 2                    Flagstar Bank, N.A.      March 12, 2023     10540
 3    First–Citizens Bank & Trust Company      March 10, 2023     10539
 4                            Equity Bank    October 23, 2020     10538
 ..                                   ...                 ...       ...
 562                Superior Federal, FSB       July 27, 2001      6004
 563                    North Valley Bank         May 3, 2001      4648
 564  Southern New Hampshire Bank & Trust    February 2, 2001      4647
 565              Banterra Bank of Marion   December 14, 2000      4646
 566                   Bank of the Orient    October 13, 2000      4645

 [567 rows x 7 columns]]

In [160]:
len(tables)

1

In [161]:
failures = tables[0]

In [162]:
failures

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Heartland Tri-State Bank,Elkhart,KS,25851,"Dream First Bank, N.A.","July 28, 2023",10544
1,First Republic Bank,San Francisco,CA,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
2,Signature Bank,New York,NY,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
3,Silicon Valley Bank,Santa Clara,CA,24735,First–Citizens Bank & Trust Company,"March 10, 2023",10539
4,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
...,...,...,...,...,...,...,...
562,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
563,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
564,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
565,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
566,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645

In [164]:
failures.head()

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Heartland Tri-State Bank,Elkhart,KS,25851,"Dream First Bank, N.A.","July 28, 2023",10544
1,First Republic Bank,San Francisco,CA,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
2,Signature Bank,New York,NY,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
3,Silicon Valley Bank,Santa Clara,CA,24735,First–Citizens Bank & Trust Company,"March 10, 2023",10539
4,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538

computing the number of bank failures by year:

In [165]:
close_timestamps = pd.to_datetime(failures['Closing DateClosing'])

In [166]:
close_timestamps.dt.year.value_counts().head(10)

2010    157
2009    140
2011     92
2012     51
2008     25
2013     24
2014     18
2002     11
2015      8
2017      8
Name: Closing DateClosing, dtype: int64

In [168]:
close_timestamps.dt.year.value_counts().tail(10)

2017    8
2016    5
2020    4
2019    4
2023    4
2001    4
2004    4
2007    3
2003    3
2000    2
Name: Closing DateClosing, dtype: int64

### Parsing XML with lxml.objectify

In [187]:
from lxml import objectify

In [200]:
with open('examples/performance_MNR.xml') as f:
    root = objectify.parse(f).getroot()

In [212]:
data = []
for elem in root.INDICATOR:
    el_data = {}
    for child in elem.getchildren():
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [215]:
data[:1]

[{'INDICATOR_SEQ': 28445,
  'PARENT_SEQ': '',
  'AGENCY_NAME': 'Metro-North Railroad',
  'INDICATOR_NAME': 'On-Time Performance (West of Hudson)',
  'DESCRIPTION': 'Percent of commuter trains that arrive at their destinations within 5 minutes and 59 seconds of the scheduled time. West of Hudson services include the Pascack Valley and Port Jervis lines. Metro-North Railroad contracts with New Jersey Transit to operate service on these lines.\n',
  'PERIOD_YEAR': 2008,
  'PERIOD_MONTH': 1,
  'CATEGORY': 'Service Indicators',
  'FREQUENCY': 'M',
  'DESIRED_CHANGE': 'U',
  'INDICATOR_UNIT': '%',
  'DECIMAL_PLACES': 1,
  'YTD_TARGET': 95.000,
  'YTD_ACTUAL': 96.900,
  'MONTHLY_TARGET': 95.000,
  'MONTHLY_ACTUAL': 96.900}]

In [217]:
perf = pd.DataFrame(data)

In [219]:
perf.head(2)

,INDICATOR_SEQ,PARENT_SEQ,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,DESIRED_CHANGE,INDICATOR_UNIT,DECIMAL_PLACES,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,28445,,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,U,%,1,95.0,96.9,95.0,96.9
1,28445,,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,U,%,1,95.0,96.0,95.0,95.0

### **pandas's pandas.read_xml function turns this process into a one-line expression:

In [227]:
# pd.read_xml not working in existing version

## Binary Data Formats

### *One simple way to store (or serialize) data in binary format is using Python’s built-in pickle module. pandas objects all have a to_pickle method that writes the data to disk in pickle format:

In [230]:
df = pd.read_csv('examples/ex1.csv')

In [231]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [232]:
df.to_pickle('examples/frame_pickle')

Pickle files are in general readable only in Python. You can read any "pickled" object stored in a file by using the built-in pickle directly, or even more conveniently using pandas.read_pickle:

In [233]:
pd.read_pickle('examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [235]:
pd.read_parquet('examples/fec.parquet').head(1)

,cmte_id,cand_id,cand_nm,contbr_nm,contbr_city,contbr_st,contbr_zip,contbr_employer,contbr_occupation,contb_receipt_amt,contb_receipt_dt,receipt_desc,memo_cd,memo_text,form_tp,file_num
0,C00410118,P20002978,"Bachmann, Michelle","HARVEY, WILLIAM",MOBILE,AL,366010290,RETIRED,RETIRED,250.0,20-JUN-11,None,None,None,SA17A,736166

### Interacting with Web APIs

In [236]:
import requests

In [237]:
url = "https://api.github.com/repos/pandas-dev/pandas/issues"

In [238]:
response = requests.get(url)

In [240]:
response.raise_for_status()

In [241]:
response

In [243]:
data = response.json()

In [252]:
data[0]['title']

'REGR: groupby.transform with a UDF performance'

In [254]:
issues = pd.DataFrame(data, columns=["number", "title", 'labels', "state"])

In [255]:
issues

,number,title,labels,state
0,55256,REGR: groupby.transform with a UDF performance,"[{'id': 233160, 'node_id': 'MDU6TGFiZWwyMzMxNj...",open
1,55255,PERF: Series.duplicated for pyarrow timestamp ...,"[{'id': 8935311, 'node_id': 'MDU6TGFiZWw4OTM1M...",open
2,55254,BUG: melt method doesn't seem to preserve time...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
3,55253,TYP: towards matplotlib 3.8,[],open
4,55252,DEPR: 'A' for yearly frequency and YearEnd in ...,[],open
...,...,...,...,...
25,55204,ENH: `rsuffix` parameter of `pandas.DataFrame....,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
26,55202,"PERF: `.iloc[:, :len(columns)+1]` in case of m...","[{'id': 8935311, 'node_id': 'MDU6TGFiZWw4OTM1M...",open
27,55200,BUG: Comment in ODS-file gets included in stri...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
28,55197,ENH: Auto-detect text encoding to avoid Unicod...,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
29,55196,BUG: ExcelWriter set_column with num_format da...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open

### Interacting with Databases

In [256]:
import sqlite3

In [257]:
query = """
    CREATE TABLE test
    (a VARCHAR(20),   b VARCHAR(20), 
     c REAL,          d INTEGER
    )
"""

In [260]:
con = sqlite3.connect("examples/mydata.sqlite")

In [261]:
con.execute(query)

In [263]:
con.commit()

In [264]:
data = [("Atlanta", "Georgia", 1.25, 6),
        ("Tallahassee", "Florida", 2.6, 3),
        ("Sacramento", "California", 1.7, 5)]

In [267]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [268]:
con.executemany(stmt, data)

In [269]:
con.commit()

In [276]:
cursor = con.execute("SELECT * FROM test")

In [277]:
rows = cursor.fetchall()

In [280]:
rows

[('Atlanta', 'Georgia', 1.250, 6),
 ('Tallahassee', 'Florida', 2.600, 3),
 ('Sacramento', 'California', 1.700, 5)]

In [281]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [283]:
[x[0] for x in cursor.description]

['a', 'b', 'c', 'd']

In [284]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5